# STADVDB MCO 1

[GitHub repository](https://github.com/420Rain/STADVDB_MCO1.git) 

**BALAJADIA**, John Ryan Uy<br />
**DULATRE**, Rainier Antolin<br />
**MARQUESES**, Simon Anthony Asuncion<br />


<br> <!-- Cell padder -->
<a name="setup"></a>
## Importing and data frame setup

---

In [ ]:
# import ipywidgets as widgets
from sqlalchemy import create_engine
import seaborn as sns
import matplotlib.pyplot as plt
import scipy.stats as sst
from dotenv import load_dotenv
import os, pandas as pd

load_dotenv()

True

In [2]:
# postgresql://username:password@hostname/dbname
#conn_str = f"postgresql://{os.getenv("DB_USER")}:{os.getenv("DB_PASSWORD")}@{os.getenv("DB_HOST")}/{os.getenv("DB_DATABASE")}"
conn_str = f"postgresql://{os.getenv("DW_USER")}:{os.getenv("DW_PASS")}@{os.getenv("DW_HOST")}/{os.getenv("DW_DB")}"
%sql $conn_str

engine = create_engine(conn_str)

In [3]:
import olap_queries as oq

queries = oq.OLAP(engine)

<br> <!-- Cell padder -->
<a name="eda"></a>
## OLAP Querying

---

In [ ]:
result = pd.DataFrame(queries.query_1())
result

                   primary_title average_rating  num_votes
0                         Jersey            8.5      26360
1                       Parasite            8.5    1105251
2                       For Sama            8.5      13576
3              Kumbalangi Nights            8.5      20696
4              Avengers: Endgame            8.4    1392882
..                           ...            ...        ...
610                         Cats            2.8      58272
611                        Gully            2.7      23937
612        Student of the Year 2            2.2      23599
613                Airplane Mode            1.9       5198
614  Enes Batur: Gerçek Kahraman            1.4      10178

[615 rows x 3 columns]

In [10]:
result = pd.DataFrame(queries.query_2())
result

    broad_type    title_type  number_of_titles
0         Film         movie            728170
1         Film         short           1087856
2         Film         video            317067
3         Film          None           2133093
4        Other     videoGame             45424
5        Other          None             45424
6   Television     tvEpisode           9211339
7   Television  tvMiniSeries             65525
8   Television       tvMovie            152612
9   Television       tvPilot                 1
10  Television      tvSeries            288804
11  Television       tvShort             10779
12  Television     tvSpecial             54877
13  Television          None           9783937
14        None          None          11962454

In [11]:
result = pd.DataFrame(queries.query_3())
result

   broad_type  number_of_titles overall_average_rating
0  Television             81709                   7.58
1        Film             73696                   6.13

In [12]:
result = pd.DataFrame(queries.query_4_1())
result

              primary_name  number_of_titles average_ratings_of_titles
0              Eric Dawson              1732                      7.86
1            Carol Kritzer              1705                      7.86
2         Robert J. Ulrich              1653                      7.86
3      Junie Lowry-Johnson              1396                      7.68
4        Dee Bradley Baker              1298                      7.63
...                    ...               ...                       ...
95046      Lívia Hábermann                 5                      1.24
95047      Kaysha Woollery                 5                      1.18
95048     Callum Balmforth                 5                      1.18
95049          Adele James                 5                      1.18
95050      Andira Crichlow                 5                      1.18

[95051 rows x 3 columns]

In [13]:
result = pd.DataFrame(queries.query_4_2())
result

          primary_name  number_of_titles average_ratings_of_titles
0          Hayato Date               540                      7.67
1     Mike B. Anderson               386                      6.65
2         James Purdum               337                      6.92
3          Trey Parker               313                      7.96
4        Pamela Fryman               275                      7.91
...                ...               ...                       ...
6767    Eduardo Quiroz                 5                      3.14
6768   Serge Rodnunsky                 5                      3.06
6769        Rene Perez                 5                      3.06
6770  Joseph J. Lawson                 5                      2.76
6771      James Nguyen                 5                      1.56

[6772 rows x 3 columns]

In [14]:
result = pd.DataFrame(queries.query_4_3())
result

                          primary_title average_rating  num_votes
0                  Indasutoria no saigo            8.6        146
1                         Spirited Away            8.6     933608
2                             Ootsunami            8.4        127
3             Farewell My Beloved Lupin            8.4        107
4                           Indasutoria            8.3        137
..                                  ...            ...        ...
89  The Soseki Kite Battle Over London!            6.5         38
90            Chaos! The Doll Swap Case            6.5         37
91                 The Emerald's Secret            6.4        107
92                           Yuki's Sun            5.9       1573
93                             Nandarou            5.6        174

[94 rows x 3 columns]

In [15]:
result = pd.DataFrame(queries.query_5())
result

    decade  number_of_films
0     1910               50
1     1920              221
2     1930              712
3     1940             1021
4     1950             1319
5     1960             1540
6     1970             1796
7     1980             2014
8     1990             2741
9     2000             5182
10    2010             8160
11    2020             4664

In [16]:
result = pd.DataFrame(queries.query_6())
result

   season_number  number_of_episodes season_rating
0              1                  25          8.45

In [4]:
result = pd.DataFrame(queries.query_7())
result

         genre rating   votes
0       Action    6.2  212713
1       Action    6.0   10185
2       Action    3.2    2036
3       Action    7.4    1625
4       Action    5.4    2572
...        ...    ...     ...
46679  Western    6.1    1216
46680  Western    5.9    1619
46681  Western    7.3    6798
46682  Western    6.8    1012
46683  Western    6.3    1249

[46684 rows x 3 columns]

<br> <!-- Cell padder -->
<a name="eda"></a>
## t-Test

---

In [5]:
result = pd.DataFrame(queries.t_test_1())
result.iloc[0]

t_statistic_adult_vs_non_adult_rating    36.550496810437751096363663
Name: 0, dtype: object

In [6]:
result = pd.DataFrame(queries.t_test_2())
result.iloc[0]

t_statistic_century_rating_comparison    -11.781175660360365288496499
Name: 0, dtype: object

In [ ]:
result = pd.DataFrame(queries.t_test_3())
result.iloc[0]

t_statistic_action_vs_comedy_votes    20.3519838426744808
Name: 0, dtype: object

In [35]:
result = pd.DataFrame(queries.t_test_4())
result.iloc[0]

t_statistic_tv_series_lifespan    39.728469781810218263853296
Name: 0, dtype: object

In [4]:
result = pd.DataFrame(queries.t_test_5())
result.iloc[0]

t_statistic_franchise_vs_standalone_votes    -57.1777152742308863
Name: 0, dtype: object

In [ ]:
engine.dispose()